import React from 'react'
import styles from '../Updates/Updates.module.css'

export default function Updates() {
    const updatesDetails = [
        {
            number: "V 2.5.8",
            title: "اضافه شدن فیچر فلان",
            description: 'متنی که در ادامه آن را مطالعه خواهید کرد، حاوی شرایطی است که شما با استفاده یا مشاهده از ابزارها، محتوا و سرویس‌های "آرسونیکس"، به‌عنوان یک کاربر، می‌پذیرید. این توافق‌نامه به عنوان یک قرارداد میان "آرسونیکس" به‌عنوان ارائه‌دهنده خدمات در زمینه ارزهای دیجیتال و شما به‌عنوان کاربر، شامل مفادی است که برای حل اختلافات بین "آرسونیکس" و شما، به مراجع قانونی کشور مورد استفاده قرار می‌گیرد. همچنین، این توافق‌نامه قابل تغییر است و امکان تغییرات در آن در بازه‌های زمانی مختلف، بسته به شرایط فعلی کشور، وجود دارد. هیچ گونه تبادل ارزی کاغذی اعم از معامله دلار یا سایر ارزهای کاغذی، در آرسونیکس صورت نمی گیرد. کاربر می‌تواند جهت اطلاع از تغییرات ممکن، در بازه‌های زمانی مختلف این صفحه را بررسی نماید.',
            improvement: ['درست کردن فلان', 'بهبود فلان', 'اصلاح فلان']
        },
        {
            number: "V 2.7.8",
            title: "اضافه شدن فیچر فلان",
            description: 'متنی که در ادامه آن را مطالعه خواهید کرد، حاوی شرایطی است که شما با استفاده یا مشاهده از ابزارها، محتوا و سرویس‌های "آرسونیکس"، به‌عنوان یک کاربر، می‌پذیرید. این توافق‌نامه به عنوان یک قرارداد میان "آرسونیکس" به‌عنوان ارائه‌دهنده خدمات در زمینه ارزهای دیجیتال و شما به‌عنوان کاربر، شامل مفادی است که برای حل اختلافات بین "آرسونیکس" و شما، به مراجع قانونی کشور مورد استفاده قرار می‌گیرد. همچنین، این توافق‌نامه قابل تغییر است و امکان تغییرات در آن در بازه‌های زمانی مختلف، بسته به شرایط فعلی کشور، وجود دارد. هیچ گونه تبادل ارزی کاغذی اعم از معامله دلار یا سایر ارزهای کاغذی، در آرسونیکس صورت نمی گیرد. کاربر می‌تواند جهت اطلاع از تغییرات ممکن، در بازه‌های زمانی مختلف این صفحه را بررسی نماید.',
            improvement: ['درست کردن فلان', 'بهبود فلان', 'اصلاح فلان']
        },
        {
            number: "V 2.14.8",
            title: "اضافه شدن فیچر فلان",
            description: 'متنی که در ادامه آن را مطالعه خواهید کرد، حاوی شرایطی است که شما با استفاده یا مشاهده از ابزارها، محتوا و سرویس‌های "آرسونیکس"، به‌عنوان یک کاربر، می‌پذیرید. این توافق‌نامه به عنوان یک قرارداد میان "آرسونیکس" به‌عنوان ارائه‌دهنده خدمات در زمینه ارزهای دیجیتال و شما به‌عنوان کاربر، شامل مفادی است که برای حل اختلافات بین "آرسونیکس" و شما، به مراجع قانونی کشور مورد استفاده قرار می‌گیرد. همچنین، این توافق‌نامه قابل تغییر است و امکان تغییرات در آن در بازه‌های زمانی مختلف، بسته به شرایط فعلی کشور، وجود دارد. هیچ گونه تبادل ارزی کاغذی اعم از معامله دلار یا سایر ارزهای کاغذی، در آرسونیکس صورت نمی گیرد. کاربر می‌تواند جهت اطلاع از تغییرات ممکن، در بازه‌های زمانی مختلف این صفحه را بررسی نماید.',
            improvement: ['درست کردن فلان', 'بهبود فلان', 'اصلاح فلان']
        },
       
    ]
    return (
        <main className="container">
            <section className={styles.terms_banner}>
                <h2 className={`title ${styles.terms_title}`}>قوانین و مقررات آرسونیکس</h2>
                <p className={styles.terms_description}>در جریان آخرین تغییرات آرسونیکس باشید. </p>
            </section>

            <section className={styles.last_changes_holder}>
                {updatesDetails.map((item, index) => (
                    <article key={index} className={styles.changes_box}>
                        <h6 className={styles.version}>{item.number}</h6>
                        <div className={styles.updates_details}>
                            <h6 className={styles.updates_details_title}>{item.title}</h6>
                            <p className={styles.updates_details_description}>{item.description}</p>
                        </div>

                        <div className={styles.updates_details}>
                            <h6 className={styles.updates_details_title}>بهبود و رفع باگ‌ها</h6>
                            <ul className={styles.updates_details_list}>
                                {item.improvement.map((items, index) => (
                                    <li key={index}>{items}</li>
                                ))}
                            </ul>
                        </div>
                    </article>
                ))}
            </section>
        </main>
    )
}
